Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You may see errors as the applications start up. This may happen if one service completes startup before one of its required services (i.e. a database, Kafka broker, etc). Once everything completes startup things will work as intended.
ja_jp: アプリケーションの起動時にエラーが発生することがあります。これは、あるサービスが、そのサービスが必要とするサービス（データベース、Kafkaブローカーなど）よりも先に起動を完了した場合に発生する可能性があります。すべての起動が完了すると、意図したとおりに動作します。

source: You may see that Quarkus starts a container to generate the AppCDS archive. It does this to ensure that the Java version of the build aligns with that of the generated container image. It is possible to opt out of this by setting `quarkus.package.jar.appcds.use-container` to `false`. In that case, it is your responsibility to ensure that the Java version that will run the Quarkus application matches that of the machine building it.
ja_jp: Quarkusでは、AppCDSアーカイブを生成するためにコンテナが起動します。 これは、ビルドの Java バージョンと生成されるコンテナイメージの Java バージョンを一致させるためです。 `quarkus.package.jar.appcds.use-container` を `false` に設定することで、これをオプトアウトできます。 その場合、Quarkus アプリケーションを実行する Java バージョンが、それをビルドするマシンのバージョンと一致するようにするのはユーザーの責任です。

source: You may think that Quarkus has a lot of magic tricks. It is true in some sense but it is easily understood and comes with strong benefits in either memory optimization, startup time optimization or last but not least developer experience improvements. You can decide the amount of magic that you want and the amount of control you feel comfortable with. You don't have to use dependency injection or managed clients if you prefer doing things yourself.
ja_jp: Quarkusにはたくさんのマジックのトリックがあると思うかもしれません。ある意味ではそうなのですが、簡単に理解でき、メモリーの最適化、起動時間の最適化、または開発者の経験の向上のいずれかにおいて強力なメリットがあります。あなたが望むマジックの量と、あなたが快適に感じるコントロールの量を決めることができます。もし自分でやりたいのであれば、依存性注入や管理クライアントを使う必要はありません。

source: You may want to build the native executable directly in a container without having a final container containing the build tools. That approach is possible with a multi-stage Docker build:
ja_jp: ビルドツールを含む最終的なコンテナーを用意せずに、ネイティブ実行可能ファイルをコンテナーに直接ビルドする必要がある場合もあるはずです。このアプローチは、マルチステージの Docker ビルドで使用可能です:

source: You may want to change this to more user-friendly names, based on your requirements. For example, changing the options in the dropdown to "Intro", "Order Service", "User Service" would look like this:
ja_jp: 要件に基づいて、これらをよりユーザーフレンドリーな名前に変更したい場合があります。例えば、ドロップダウンのオプションを「Intro」、「Order Service」、「User Service」に変更すると、次のようになります。

source: You may want to check if this configuration has already been updated, to avoid multiple redundant updates, for example, due to multliple redirects.
ja_jp: 複数のリダイレクトなどにより、複数の冗長な更新を避けるために、この設定がすでに更新されているかどうかを確認したい場合があります。

source: You may want to have the access token revoked if using this token with a REST client fails with HTTP `401` or the access token has already been used for a long time and you'd like to refresh it.
ja_jp: RESTクライアントで使用するとHTTP `401` で失敗するアクセストークンを使っている場合や、長い時間使用されているアクセストークンをリフレッシュしたい場合は、アクセストークンを失効させることができます。

source: You may want to include more than the arguments of a method into a cache key. This can be done by implementing the `io.quarkus.cache.CacheKeyGenerator` interface and declaring that implementation in the `keyGenerator` field of a `@CacheResult` or `@CacheInvalidate` annotation.
ja_jp: メソッドの引数以外もキャッシュ・キーに含めたい場合があります。これは、 `io.quarkus.cache.CacheKeyGenerator` インターフェイスを実装し、その実装を `@CacheResult` または `@CacheInvalidate` アノテーションの `keyGenerator` フィールドで宣言することで実現できます。

source: You may want to use the `create-extension` mojo of `io.quarkus.platform:quarkus-maven-plugin` to create these Maven modules - see the next section.
ja_jp: `io.quarkus:quarkus-maven-plugin` の `create-extension` mojo は、新しい Quarkus エクステンションの実装に必要な Maven モジュールのスタブを生成するために使用できます。次のセクションをご覧ください。

source: You may wish to use this config to set a fixed port, or set an image name, for example.
ja_jp: たとえば、この設定を使用して固定ポートを設定したり、イメージ名を設定したりすることができます。

source: You may wonder where the URL is configured, as it’s not in the code. It should not be hard-coded because the URL likely depends on the environment. The URL is configured in the application configuration:
ja_jp: URL はコードにはないので、どこで設定されるのか疑問に思うかもしれません。URL は環境に依存する可能性が高いため、ハードコードしないでください。URL はアプリケーション設定で設定されます。

source: You may wonder why it's so important. Threads are expensive, especially in containers or on the cloud where the resources are limited. Using the I/O threads avoids creating additional threads (improving memory consumption) and avoids context switches (improving response time). Emmanuel explained the benefits in the https://quarkus.io/blog/io-thread-benchmark/[A IO thread and a worker thread walk into a bar: a microbenchmark story] blog post.
ja_jp: 何故そんなに重要なのかと思われるかもしれません。スレッドは高価です。特にコンテナやクラウド上ではリソースが限られています。I/O スレッドを使用すると、追加のスレッドを作成せずに済み（メモリ消費量の改善）、コンテキストスイッチを回避できます（応答時間の改善）。Emmanuelは、 link:https://quarkus.io/blog/io-thread-benchmark/[A IO thread and a worker thread walk into a bar: a microbenchmark story]のブログ記事でそのメリットを説明しています。

source: You might also have to register one or more test users:
ja_jp: また、1人以上のテストユーザーを登録する必要があるかもしれません：

source: You might also start a database up front:
ja_jp: 事前にデータベースを起動することもできます。

source: You might also want to set `quarkus.oidc.authentication.cookie-path` to a path value common to all the application resources, which is `/` in this example. For more information, see the <<oidc-cookies,Cookies>> section.
ja_jp: また、 `quarkus.oidc.authentication.cookie-path` をすべてのアプリケーションリソースに共通のパス値 (この例では `/`) に設定することも推奨します。 詳細は、<<oidc-cookies,Cookies>> セクションを参照してください。

source: You might be facing a Docker issue that mainly affects MacOS users attempting to use Keycloak locally where the ports do not automatically bind to `localhost`.
ja_jp: Keycloak をローカルで使用しようとしている macOS ユーザーに主に影響する Docker の問題に直面している可能性があります。この問題では、ポートが自動的に `localhost` にバインドされません。

source: You might have heard about https://github.com/quarkiverse/quarkus-github-app[my Quarkus GitHub App extension] that allows you to develop GitHub Apps based on Quarkus at light speed with very little boilerplate (shameless ad: it is awesome!).
ja_jp: link:https://github.com/quarkiverse/quarkus-github-app[私のQuarkus GitHub Appエクステンション]は、QuarkusをベースにしたGitHubアプリを、ほとんど定型文を使わずに軽快に開発できます（恥知らずな宣伝：素晴らしいです！）。

source: You might have noticed that we didn't configure the schema registry URL anywhere. This is because Dev Services for Apicurio Registry configures all Kafka channels in Quarkus Messaging to use the automatically started registry instance.
ja_jp: スキーマレジストリのURLをどこにも設定していないことに気づいたかもしれません。 これは、Dev Services for Apicurio Registryによって、Quarkus MessagingのすべてのKafkaチャンネルが、自動的に起動されたレジストリインスタンスを使用するように設定されるためです。

source: You might have noticed that we didn't configure the schema registry URL anywhere. This is because Dev Services for Apicurio Registry configures all Kafka channels in SmallRye Reactive Messaging to use the automatically started registry instance.
ja_jp: ここまで、スキーマレジストリーの URL を設定していません。なぜなら、Dev Services for Apicurio Registry が、自動的に開始されたレジストリーインスタンスを使用するように、SmallRye リアクティブメッセージングのすべての Kafka チャネルを設定するからです。

source: You might have noticed that we didn't define the `value.deserializer`. That's because Quarkus can xref:kafka.adoc#serialization-autodetection[autodetect] that `io.apicurio.registry.serde.avro.AvroKafkaDeserializer` is appropriate here, based on the `@Channel` declaration, structure of the `Movie` type, and presence of the Apicurio Registry libraries. We don't have to define the `apicurio.registry.use-specific-avro-reader` property either, that is also configured automatically.
ja_jp: `value.deserializer` を定義しなかったことにお気づきかもしれません。これは、 `@Channel` 宣言、 `Movie` タイプの構造、Apicurio Registry ライブラリーの存在に基づき、 `io.apicurio.registry.serde.avro.AvroKafkaDeserializer` が適切であることを、Quarkus が xref:kafka.adoc#serialization-autodetection[自動検出] できるためです。 `apicurio.registry.use-specific-avro-reader` プロパティーも自動で設定されるため、定義する必要はありません。

source: You might have noticed that we didn't define the `value.serializer`. That's because Quarkus can xref:kafka.adoc#serialization-autodetection[autodetect] that `io.apicurio.registry.serde.avro.AvroKafkaSerializer` is appropriate here, based on the `@Channel` declaration, structure of the `Movie` type, and presence of the Apicurio Registry libraries. We still have to define the `apicurio.registry.auto-register` property.
ja_jp: `value.serializer` を定義しなかったことにお気づきかもしれません。これは、 `@Channel` 宣言、 `Movie` タイプの構造、Apicurio Registry ライブラリーの存在に基づき、 `io.apicurio.registry.serde.avro.AvroKafkaSerializer` が適切であることを、Quarkus が xref:kafka.adoc#serialization-autodetection[自動検出] できるためです。それでも、 `apicurio.registry.auto-register` プロパティーは定義する必要があります。

source: You might have read our first post about Project Leyden and the new perspective it brought, but how did we actually integrate it into Quarkus? In this post, we share our journey and the improvements we made along the way.
ja_jp: Project Leyden とそれがもたらした新しい視点についての最初の投稿を読まれたかもしれませんが、実際にどのように Quarkus に統合したのでしょうか？この投稿では、その道のりと、その過程で行った改善点を紹介します。

source: You might need to add it as a dependency explicitly if you are using transactions directly without Hibernate ORM for example. Add the following to your build file:
ja_jp: 例えば、Hibernate ORMを使用せずに直接トランザクションを使用している場合は、明示的に依存関係として追加する必要があるかもしれません。以下をビルドファイルに追加します:

source: You might need to register a redirect URI for the authorization code flow initiated by Dev UI for Keycloak to work. This is because Keycloak might enforce that the authenticated users are redirected only to the configured redirect URI. It is recommended to do this in production to avoid the users being redirected to the wrong endpoints, which might happen if the correct `redirect_uri` parameter in the authentication request URI has been manipulated.
ja_jp: Keycloak 用の Dev UI によって開始される認可コードフローを機能させるには、リダイレクト URI を登録する必要がある場合があります。 Keycloak は、認証されたユーザーが設定されたリダイレクト URI にのみリダイレクトされるように強制する場合があるためです。 認証リクエスト内の正しい `redirect_uri` パラメーターが操作されると、ユーザーが間違ったエンドポイントにリダイレクトされる可能性があるため、本番環境ではこれを行うことを推奨します。

source: You might need to request that a specific set of scopes be associated with an issued access token. Use a dedicated `quarkus.oidc-client.scopes` list property, for example: `quarkus.oidc-client.scopes=email,phone`
ja_jp: スコープの特定のセットが発行されたアクセストークンに関連付けられるように要求する必要がある場合があります。専用の `quarkus.oidc-client.scopes` リストプロパティーを使用してください (例: `quarkus.oidc-client.scopes=email,phone`)。

source: You might need to wait a couple of seconds until the curler pod comes up. Run the following to get bash access to the curler pod:
ja_jp: curler ポッドが立ち上がるまで、数秒待つ必要があるかもしれません。以下を実行して、curler pod への bash アクセスを取得します:

source: You might override the default value of the `myapp.schema.create` property in the `application.properties` file.
ja_jp: `application.properties` ファイルの `myapp.schema.create` プロパティーのデフォルト値を上書きできます。

source: You might recall that Quarkus allows you to use Mutiny return types (Uni and Multi) when using RESTEasy Classic via the `quarkus-resteasy-mutiny` extension and thus might be wondering how that compares to using RESTEasy Reactive.
ja_jp: RESTEasy Classic を使用しているときに Quarkus では、 `quarkus-resteasy-mutiny` エクステンションを介して Mutiny 戻り値の型 (UniとMulti) を使用することができることや、これが RESTasy Reactive の使用と、どのように異なるかと思うかもしれません。

source: You might want to have the access token revoked if using this token with a REST client fails with an HTTP `401` status code or if the access token has already been used for a long time and you would like to refresh it.
ja_jp: このトークンを REST クライアントで使用すると HTTP `401` ステータスコードで失敗するか、アクセストークンがすでに長期間使用されていて更新する場合は、アクセストークンを取り消してください。

source: You might want to know about the following ones in case you're comparing performance properties with other builds.
ja_jp: 他のビルドと性能特性を比較する場合には、以下のようなものを把握しておくとよいです。

source: You might want to revoke the access token if a REST client call that uses this token fails with an HTTP `401` status code, or if the token has been used for a long time and you want to refresh it.
ja_jp: このトークンを使用する REST クライアント呼び出しが HTTP `401` ステータスコードで失敗した場合、またはトークンが長期間使用されていて更新したい場合は、アクセストークンを取り消すことができます。

source: You might wonder why we use _reactive_ extensions. Virtual threads have limitations, and we can only integrate them properly when using the reactive extensions. No worries: your code will be written 100% in a synchronous / imperative style.
ja_jp: なぜ _リアクティブ_ エクステンションを使うのか不思議に思うかもしれません。 仮想スレッドには限界があり、リアクティブエクステンションを使用する場合にのみ適切に統合することができます。 ご心配なく。あなたのコードは100%同期/命令型スタイルで書かれます。

source: You must **NEVER** block these event loops. If you do, the whole model collapses. Thus, when the processing of an HTTP request needs to execute an I/O operation (such as calling an external service), it:
ja_jp: これらのイベントループは *絶対に* ブロックしてはいけません。 もしブロックしてしまうと、モデル全体が崩壊してしまいます。 このように、HTTPリクエストの処理がI/O操作(外部サービスの呼び出しなど)を実行する必要がある場合、その処理は：

source: You must add a role such as `admin` to the users registered in the `Auth0` application.
ja_jp: `Auth0` アプリケーションに登録されているユーザーに、 `admin` などのロールを追加する必要があります。

source: You must add this to your pom:
ja_jp: これを pom に追加する必要があります。

source: You must also add your preferred database connector library. The instructions in this example tutorial use a PostgreSQL database for the identity store.
ja_jp: 優先するデータベースコネクターライブラリーも追加する必要があります。 このサンプルチュートリアルの手順では、アイデンティティーストアに PostgreSQL データベースを使用します。

source: You must also force your AWS service client for SQS, SNS, S3 et al, to use the URL Connection client, which connects to AWS services over HTTPS, hence the inclusion of the SSL enabled property, as described in the <<https>> section above.
ja_jp: また、SQS, SNS, S3などのAWSサービスクライアントでは、 link:#https[HTTPS] でAWSサービスに接続するURL Connectionクライアントを強制的に使用する必要があります。

source: You must also force your AWS service client for SQS, SNS, S3 et al., to use the URL Connection client, which connects to AWS services over HTTPS, hence the inclusion of the SSL enabled property, as described in the <<https>> section above.
ja_jp: また、SQS、SNS、S3 などの AWS サービスクライアントは、 https で AWS サービスに接続する URL Connection クライアントを使用するように強制する必要があり、そのため、上記の <<https>> セクションで説明したように、SSL enabled プロパティーが含まれています。

source: You must also force your AWS service client for SQS, SNS, S3 et al., to use the URL Connection client, which connects to AWS services over HTTPS, hence the inclusion of the SSL enabled property, as described in the xref:https[Using HTTPS or SSL/TLS] section above.
ja_jp: また、SQS、SNS、S3などのAWSサービスクライアントは、 httpsでAWSサービスに接続するURL Connectionクライアントを使用するように強制する必要があり、そのため、上記の xref:https[HTTPSまたはSSL/TLSの使用] セクションで説明したように、SSL enabledプロパティが含まれています。

source: You must always register your Web component as a custom element, with a unique tag. Here, the tag will follow the same format as the filename (`qwc` dash `extension name` dash `page title` );
ja_jp: Web コンポーネントは、必ず一意のタグを持つカスタム要素として登録する必要があります。その場合のタグは、ファイル名と同じ形式 (`qwc` ダッシュ `エクステンション名` ダッシュ `ページタイトル`) である必要があります。

source: You must always use the `@TestSecurity` annotation. Its `user` property is returned as `JsonWebToken.getName()` and its `roles` property is returned as `JsonWebToken.getGroups()`. The `@OidcSecurity` annotation is optional and you can use it to set the additional token claims and the `UserInfo` and `OidcConfigurationMetadata` properties. Additionally, if the `quarkus.oidc.token.issuer` property is configured, it is used as an `OidcConfigurationMetadata` `issuer` property value.
ja_jp: `@TestSecurity` アノテーションは常に使用する必要があります。 その `user` プロパティーは `JsonWebToken.getName()` として返され、その `roles` プロパティーは `JsonWebToken.getGroups()` として返されます。 `@OidcSecurity` アノテーションは任意です。これを使用すると、追加のトークンクレームと `UserInfo` および `OidcConfigurationMetadata` プロパティーを設定できます。 さらに、 `quarkus.oidc.token.issuer` プロパティーが設定されている場合、 `OidcConfigurationMetadata` `issuer` プロパティー値として使用されます。

source: You must configure authentication in the `hotrod-client.properties` file if you use Dependency Injection.
ja_jp: 依存性注入を使用する場合は、 `hotrod-client.properties` ファイルで認証の設定を行う必要があります。

source: You must confirm that the browser sets an `Origin` header for cross-origin requests when accessing your application, especially with HTML forms, before using the CORS filter to prevent CSRF through link:https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#using-standard-headers-to-verify-origin[Origin verification].
ja_jp: 特に HTML フォームを使用する場合、アプリケーションにアクセスする際にブラウザーがクロスオリジンリクエストに対して `Origin` ヘッダーを設定することを確認してから、CORS フィルターを使用して link:https://cheatsheetseries.owasp.org/cheatsheets/Cross-Site_Request_Forgery_Prevention_Cheat_Sheet.html#using-standard-headers-to-verify-origin[オリジン検証] による CSRF を防止する必要があります。

source: You must create a native executable for your application that targets a supported operating system and match the architecture. This means, if you are building on Windows, you create a native Linux executable by using a container runtime, for example, Docker or Podman.
ja_jp: サポートされているオペレーティングシステムをターゲットとし、アーキテクチャーに一致するアプリケーションのネイティブ実行可能ファイルを作成する必要があります。これは、Windows でビルドしている場合、コンテナーランタイム (例: Docker や Podman) を使用してネイティブ Linux 実行可能ファイルを作成することを意味します。

source: You must ensure that the callback path you enter in the GitHub OAuth application configuration matches the endpoint path where you want the user to be redirected after a successful GitHub authentication and application authorization. In this case, it has to be set to `http://localhost:8080/github/userinfo`.
ja_jp: GitHub OAuth アプリケーション設定に入力するコールバックパスが、GitHub 認証とアプリケーション認可が成功した後にユーザーをリダイレクトするエンドポイントパスと一致していることを確認する必要があります。 この場合は、 `http://localhost:8080/github/userinfo` に設定する必要があります。

source: You must ensure that the callback path you enter in the GitHub OAuth application configuration matches the endpoint path where you want the user to be redirected after a successful GitHub authentication and application authorization. In this case, it has to be set to `http:localhost:8080/github/userinfo`.
ja_jp: GitHub OAuth アプリケーション設定に入力するコールバックパスが、GitHub 認証とアプリケーション認可が成功した後にユーザーをリダイレクトするエンドポイントパスと一致していることを確認する必要があります。 この場合は、 `http:localhost:8080/github/userinfo` に設定する必要があります。

source: You must have the https://learn.microsoft.com/en-us/azure/azure-functions/functions-run-local#v2[Azure Functions Core Tools] installed for this to work.
ja_jp: この機能を利用するには、 https://learn.microsoft.com/en-us/azure/azure-functions/functions-run-local#v2[Azure Functions Core Tools] がインストールされている必要があります。

source: You must include the Protostream annotations processor in your build file. Starting with Java 24, schema generation will not work unless this annotation processor is explicitly added.
ja_jp: Protostream アノテーション プロセッサーをビルドファイルに含める必要があります。 Java 24 以降、このアノテーション プロセッサーを明示的に追加しない限り、スキーマ生成は機能しません。

source: You must include the `quarkus-azure-functions-http` extension as this is a generic bridge between the Azure Functions runtime and the HTTP framework you are writing your microservices in.
ja_jp: `quarkus-azure-functions-http` エクステンションを含める必要があります。これは、Azure Functions ランタイムとマイクロサービスを書いている HTTP フレームワークの間の一般的なブリッジです。

source: You must map the `microprofile_jwt_user` role to `SecurityIdentity` roles, and you can do so with this configuration: `quarkus.oidc.roles.role-claim-path=groups/roles`.
ja_jp: `microprofile_jwt_user` ロールは、 `SecurityIdentity` ロールにマップする必要があります。これは、 `quarkus.oidc.roles.role-claim-path=groups/roles` 設定で実行できます。

source: You must register the JSON‑RPC service in the deployment module:
ja_jp: デプロイメントモジュールで JSON‑RPC サービスを登録する必要があります。

source: You must register the `JsonPRCService` in your processor in the deployment module:
ja_jp: デプロイメントモジュールのプロセッサーに `JsonPRCService` を登録する必要があります。

source: You must return/produce a `FooterLogBuildItem`.
ja_jp: `FooterLogBuildItem` を返す/生成する必要があります。

source: You must train your application and generate the AOT cache. In practice, this is not difficult, and in Quarkus, we have made it as seamless as possible.
ja_jp: アプリケーションをトレーニングし、AOT キャッシュを生成する必要があります。実際には、これは難しくなく、Quarkus では可能な限りシームレスにしました。

source: You must update the application registered with the <<google>> provider to list `http://localhost:8080/calendar/event` as one of the authorized redirect URIs if you would like to test this endpoint on the local host, for example:
ja_jp: このエンドポイントをローカルホストでテストしたい場合は、<<google>> プロバイダに登録するアプリケーションを更新して、認可されたリダイレクト URI のひとつとして `http://localhost:8080/calendar/event` を認可されたリダイレクト URI の一つとしてリストアップするように Google プロバイダに登録されたアプリケーションを更新する必要があります。

source: You need <a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">an IDE</a> like <a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>, <a href="https://www.eclipse.org/downloads/">Eclipse</a>, <a href="https://code.visualstudio.com/Download">VSCode</a> or even <a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a> or <a href="http://spacemacs.org">Emacs</a>!
ja_jp: <a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>、<a href="https://www.eclipse.org/downloads/">Eclipse</a>、<a href="https://code.visualstudio.com/Download">VSCode</a>もしくは<a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a>や<a href="http://spacemacs.org">Emacs</a>のような<a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">IDE</a>が必要です

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a>
ja_jp: <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a>

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a> or <a href="https://gradle.org/" target="_blank">Gradle</a>
ja_jp: <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a> もしくは<a href="https://gradle.org/" target="_blank">Gradle</a> が必要です

source: You need a <a href="https://adoptopenjdk.net" target="_blank">a JDK {{ site.data.versions.jdk }}</a> (any distribution)
ja_jp: <a href="https://adoptopenjdk.net" target="_blank">JDK {{ site.data.versions.jdk }}</a> (ディストリビューションは問いません) が必要です

source: You need a deserializer that can create a `Fruit` from the record. This can be done using a Jackson deserializer:
ja_jp: レコードから `Fruit` を作成できるデシリアライザーが必要です。これは、Jackson デシリアライザーを使用して実行できます。

source: You need at least one running instance of the Infinispan Server.
ja_jp: 実行中のInfinispan サーバーのインスタンスが少なくとも1つ必要です。

source: You need clustering support for your scheduled tasks? This guide explains how to use the Quartz extension for that.
ja_jp: スケジュールされたタスクにクラスタリングのサポートが必要ですか？このガイドでは、そのための Quartz エクステンションの使い方を説明します。

source: You need four properties to get started with the authorization code flow:
ja_jp: 認可コードフローを開始するには、4 つのプロパティーが必要です。

source: You need the following configuration:
ja_jp: 次の設定が必要です。

source: You need to call `insert()` instead of `persist()` to insert the entity in the database
ja_jp: データベースにエンティティーを挿入するには、`persist()` の代わりに `insert()` を呼び出す必要があります。

source: You need to click on `Generate a new client secret`, confirm your credentials, and write down your Client ID and Client secret (especially that one, because you will not be able to see it again later from that page, but you can always recreate one, do don't worry too much):
ja_jp: `Generate a new client secret` をクリックし、クレデンシャルを確認して、Client ID と Client Secret を書き留める必要があります (特に Client Secret は、後でこのページで再度見ることができないため、書き留めてください。 ただし、いつでも再作成できますので、心配しすぎる必要はありません)。

source: You need to configure
ja_jp: 以下を設定する必要があります。

source: You need to configure your application with the following minimal properties:
ja_jp: アプリケーションには、以下の最小限のプロパティーを設定する必要があります:

source: You need to define a bean implementing the `WebAuthnUserProvider` in order to allow the Quarkus WebAuthn extension to load and store credentials. This is where you tell Quarkus how to turn your data model into the WebAuthn security model:
ja_jp: Quarkus WebAuthn エクステンションでクレデンシャルをロードおよび保存できるようにするには、 `WebAuthnUserProvider` を実装する bean を定義する必要があります。ここで、データモデルを WebAuthn セキュリティモデルに変換する方法を Quarkus に指示します。
